Heatsink study of a FPV Drone/gemFan_Cases/rpm/rpm_0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    //block0 vertices
    ( -1.00 1.00 -3.2) //0
    ( -4.24 4.24 -3.2) //1
    ( 4.24 4.24 -3.2) //2
    ( 1.00 1.00 -3.2) //3
    ( -1.00 1.00 2.0) //4
    ( -4.24 4.24 2.0) //5
    ( 4.24 4.24 2.0) //6
    ( 1.00 1.00 2.0) //7
    
    //block1 vertices
    ( 1.00 -1.00 -3.2) //8
    ( 4.24 -4.24 -3.2) //9
    ( 1.00 -1.00 2.00) //10
    ( 4.24 -4.24 2.00) //11

    //block2 vertices
    ( -1.00 -1.00 -3.2) //12
    ( -4.24 -4.24 -3.2) //13
    ( -1.00 -1.00 2.00) //14
    ( -4.24 -4.24 2.00) //15*/
);

xcells 40;
ycells 40;
zcells 40;

blocks
(	
    //block0
    hex (0 3 2 1 4 7 6 5) ($xcells $ycells $zcells) simpleGrading (1 5 1)
    //block1
    hex (3 8 9 2 7 10 11 6) ($xcells $ycells $zcells) simpleGrading (1 5 1)    
    //block2
    hex (8 12 13 9 10 14 15 11) ($xcells $ycells $zcells) simpleGrading (1 5 1)
    //block3
    hex (12 0 1 13 14 4 5 15) ($xcells $ycells $zcells) simpleGrading (1 5 1)
    //block4
    hex (0 12 8 3 4 14 10 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
    //block0 arc
    arc 1 2 (0 6 -3.2)
    arc 5 6 (0 6 2)
    
    //block1 arc
    arc 2 9 (6 0 -3.2)
    arc 6 11 (6 0 2)
    
    //block2 arc 
    arc 9 13 (0 -6 -3.2)
    arc 11 15 (0 -6 2)
    
    //block3 arc
    arc 1 13 (-6 0 -3.2)
    arc 5 15 (-6 0 2)
);

boundary
(
    LowerWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (2 3 8 9)
            (8 9 13 12)
            (13 12 0 1)
            (0 3 8 12)
        );
    }
    
    UpperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (6 7 10 11)
            (15 11 10 14)
            (15 14 4 5)
            (4 7 10 14)
        );    
    }
    
    SideWall
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 11 9)
            (9 11 15 13)
            (15 13 5 1)
        );    
    }
);

// ************************************************************************* //
